librbd_iscsi/yujiang/write/logs/fio-iscsi-8k.fio.log
lv0: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16401288;27335;3416;600004;1;390;9.878583;7.671095;1121;872758;4670.648465;8413.329026;1.000000%=1908;5.000000%=2277;10.000000%=2473;20.000000%=2736;30.000000%=2932;40.000000%=3129;50.000000%=3325;60.000000%=3588;70.000000%=3883;80.000000%=4423;90.000000%=6455;95.000000%=13565;99.000000%=19529;99.500000%=27394;99.900000%=98041;99.950000%=164626;99.990000%=358612;0%=0;0%=0;0%=0;1153;872764;4680.827388;8413.271788;768;39200;99.993150%;27333.127500;5882.874604;1.299327%;4.503977%;1414928;0;94;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;1.55%;71.02%;19.70%;6.84%;0.66%;0.13%;0.07%;0.02%;0.01%;0.01%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3392042: Thu May 21 07:35:47 2020
  write: IOPS=3416, BW=26.7MiB/s (27.0MB/s)(15.6GiB/600004msec)
    slat (nsec): min=1650, max=390249, avg=9878.58, stdev=7671.10
    clat (usec): min=1121, max=872758, avg=4670.65, stdev=8413.33
     lat (usec): min=1153, max=872764, avg=4680.83, stdev=8413.27
    clat percentiles (usec):
     |  1.00th=[  1909],  5.00th=[  2278], 10.00th=[  2474], 20.00th=[  2737],
     | 30.00th=[  2933], 40.00th=[  3130], 50.00th=[  3326], 60.00th=[  3589],
     | 70.00th=[  3884], 80.00th=[  4424], 90.00th=[  6456], 95.00th=[ 13566],
     | 99.00th=[ 19530], 99.50th=[ 27395], 99.90th=[ 98042], 99.95th=[164627],
     | 99.99th=[358613]
   bw (  KiB/s): min=  768, max=39200, per=99.99%, avg=27333.13, stdev=5882.87, samples=1200
   iops        : min=   96, max= 4900, avg=3416.63, stdev=735.36, samples=1200
  lat (msec)   : 2=1.55%, 4=71.02%, 10=19.70%, 20=6.84%, 50=0.66%
  lat (msec)   : 100=0.13%, 250=0.07%, 500=0.02%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.30%, sys=4.50%, ctx=1414928, majf=0, minf=94
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2050161,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=26.7MiB/s (27.0MB/s), 26.7MiB/s-26.7MiB/s (27.0MB/s-27.0MB/s), io=15.6GiB (16.8GB), run=600004-600004msec